second practical 
ntp server

1)pehle jo diagram diya hain usko banao ip dalo aur usme ping se check karo 
2)server ke service me jakr ntp select karo , enable karo user 1 password NTP55 likho
3)router ke cli me jakr command likho 
 
 Command :
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ntp server 192.168.2.2
Router(config)#ntp update-calendar
Router(config)#exit
Router#
Router#show clock

3rd practical SYSLOGS
1)pehle jo diagram diya hain usko banao ip dalo aur usme ping se check karo 
2)server ke service me jakr SYSLOGS select karo , ON karo
3)router ke cli me jakr command likho 
 

command:
	
Router#
Router#en
Router#ping 192.168.2.2
Router#conf t
Router(config)#logging 192.168.2.2

output ke liye sylog me hi jayo 

4) 

3rd practical ssh
1)pehle jo diagram diya hain usko banao ip dalo aur usme ping se check karo 
2)server ke service me jakr ftp, ON karo
3)router ke cli me jakr command likho 
 
Router>en
Router#conf t
Router(config)#ip domain-name admin.com
Router(config)#hostname admin
admin(config)#crypto key generate rsa
The name for the keys will be: admin.admin.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

admin(config)#line vty 0
*Mar 1 0:2:30.760: %SSH-5-ENABLED: SSH 1.99 has been enabled
admin(config-line)#line vty 0 4
admin(config-line)#transport input ssh
admin(config-line)#login local
admin(config-line)#username admin privilege 6 password 123456


pc me type 
ssh -l admin 192.168.1.1





aaa radious and aaa cascas
1)pehle jo diagram diya hain usko banao ip dalo
2)fast connection karenge 
3)server ke service me aaa jayenge vha secret(abcd) key client(raeesh),username(raeesh),password(wxyz) dalenge 
4)uske badh router ke cli me commad likho
  
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#aaa ne
Router(config)#aaa new-model
Router(config)#tacacs-server host 192.168.2.3 key abcd
Router(config)#radius-server host 192.168.2.2 key abcd
Router(config)#aaa authentication login raeesh group tacacs+ group radius local
Router(config)#line vty 0 4
Router(config-line)#login authentication raeesh
Router(config-line)#exit
Router(config)#exit


5)output ke liye pc me 
telnet router ki ip jidhar se server connect hain
telnet 192.168.2.1




ip6 deny http& https
1)jaisa diagram diya hain usko banao ip niche dalo aur slash me 64 dalo 
1)ip sirf pc aur server ko denge 
2)sab fast enternet se connect hoga 
3)iske aage router ke cli me likho

Router>enable
Router#
Router#configure terminal 
Router(config)#ipv6 unicast-routing 
Router(config)#interface GigabitEthernet0/0
Router(config-if)#ipv6 address 2001::1/64
Router(config-if)#ipv6 rip a enable 
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ipv6 address 2002::1/64
Router(config-if)#ipv6 rip a enable
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#

http deny ke liye cli me uper vale ke niche yh bhi command likh do 

Router(config)#ipv6 access-list raeesh
Router(config-ipv6-acl)#deny tcp any host 2002::2 eq www
Router(config-ipv6-acl)#deny tcp any host 2002::2 eq 443
Router(config-ipv6-acl)#exit
Router(config)#interface gigabitEthernet0/1
Router(config-if)#ipv6 traffic-filter raeesh in
Router(config-if)#
Router(config-if)#exit


output dekhne ke liye pc ke http me jakr server ka ip likho 





ftp 
1)fast connection
2)2t on


Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#access-list 100 permit tcp 192.168.1.2 0.255.255.255 host 192.168.2.2 eq ftp
Router(config)#interface gigabitEthernet0/0
Router(config-if)#ip access-group 100 in
Router(config-if)#exit
















